Revit 2026 API

# UIControlledApplicationTransferredProjectStandards Event

---

Subscribe to the TransferredProjectStandards event to be notified after the scope of a Transfer Project Standards operation has been finalized in the Transfer Project Standards dialog.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public event EventHandler<TransferredProjectStandardsEventArgs> TransferredProjectStandards
```
```vb
Public Event TransferredProjectStandards As EventHandler(Of TransferredProjectStandardsEventArgs)
```
```cpp
public:
 event EventHandler<TransferredProjectStandardsEventArgs^>^ TransferredProjectStandards {
	void add (EventHandler<TransferredProjectStandardsEventArgs^>^ value);
	void remove (EventHandler<TransferredProjectStandardsEventArgs^>^ value);
}
```
```fsharp
member TransferredProjectStandards : IEvent<EventHandler<TransferredProjectStandardsEventArgs>,
    TransferredProjectStandardsEventArgs>
```

#### Value

EventHandlerTransferredProjectStandardsEventArgs

This event is raised just after the native Revit items have been transferred, but before the transaction has been committed. An add - in that registered external items in TransferringProjectStandards should subscribe to this event to carry out the transfer of any items that it registered if the user enabled those items for transfer. During the scope of this event, modification is permitted to the target document and modification is not permitted to the source document.

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace